function solution(letter) {
    let morse = { '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
                '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
                '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
                '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
                '-.--':'y','--..':'z'};
    return letter.split(" ")    // 들어온 매개변수를 공백을 기준으로 나누어 배열로 만듦
        .map(a => morse[a]) // morse 에 매핑되는 value 를 새로운 배열로 반환
        .join("");  // 배열의 모든 요소를 연결해 새로운 문자열로 만듦
}


console.log(solution(".... . .-.. .-.. ---"));